CSI API ETABS v1
cCaseStaticNonlinear.GetGeometricNonlinearity Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGeometricNonlinearity(
	string Name,
	ref int NLGeomType
)
Function GetGeometricNonlinearity (
	Name As String,
	ByRef NLGeomType As Integer
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim NLGeomType As Integer
Dim returnValue As Integer
returnValue = instance.GetGeometricNonlinearity(Name,
	NLGeomType)
int GetGeometricNonlinearity(
	String^ Name,
	int% NLGeomType
)
abstract GetGeometricNonlinearity :
        Name : string *
        NLGeomType : int byref -> int
Parameters
Name
Type: System.String
NLGeomType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace